# Dotfiles dependencies. Run: `brew bundle --file=~/.dotfiles/Brewfile`

# Core
brew "stow"          # symlink manager — drives the dotfiles layout
brew "git"

# Shell
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zoxide"        # smart `cd`
brew "starship"      # prompt

# Multiplexer / terminal
brew "tmux"
brew "zellij"

# Editor
brew "neovim"        # >= 0.12 required for vim.pack

# Fuzzy / search / cat
brew "fzf"
brew "fd"
brew "bat"
brew "ripgrep"

# Apps
cask "ghostty"
cask "karabiner-elements"
cask "zed"
